In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [4]:
df['FlightNumber'][1] = 10055
df['FlightNumber'][3] = 10075

<ipython-input-4-d6cf6dacde38>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1] = 10055
<ipython-input-4-d6cf6dacde38>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3] = 10075

In [5]:
def make_int(x):
    return int(x)
df['FlightNumber'] = df['FlightNumber'].apply(make_int)

In [6]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2

In [7]:
def split_from(x):
    a = x.split('_')
    return a[0]
df['Form']=df['From_To'].apply(split_from)

In [8]:
def split_from(x):
    a = x.split('_')
    return a[1]
df['To']=df['From_To'].apply(split_from)

In [9]:
df

,From_To,FlightNumber,RecentDelays,Airline,Form,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# 3

In [10]:
def Standardise_fun(x):
    a = x.lower()
    b = a[1:]
    a = a[:1]
    a = a.upper()
    return a+b
df['Form']=df['Form'].apply(Standardise_fun)

In [11]:
def Standardise_fun_to(x):
    a = x.lower()
    b = a[1:]
    a = a[:1]
    a = a.upper()
    return a+b
df['To']=df['To'].apply(Standardise_fun_to)

In [12]:
df[['Form','To']]

       Form         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4

In [13]:
df = df.drop('From_To',axis=1)

In [14]:
df

   FlightNumber  RecentDelays              Airline      Form         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# 5

In [15]:
def delay_function(x):
    i=0
    try:
        return x[i]
    except:
        return 'nan'

df['delay_1']=df['RecentDelays'].apply(delay_function)

In [16]:
def delay_function(x):
    i=1
    try:
        return x[i]
    except:
        return 'nan'

df['delay_2']=df['RecentDelays'].apply(delay_function)

In [17]:
def delay_function(x):
    i=2
    try:
        return x[i]
    except:
        return 'nan'

df['delay_3']=df['RecentDelays'].apply(delay_function)

In [18]:
df

,FlightNumber,RecentDelays,Airline,Form,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,nan
1,10055,[],<Air France> (12),Madrid,Milan,nan,nan,nan
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,nan,nan
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,nan